## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                      |
|--------|--------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.client_vpn`                                               |
|        | `module.vpn.aws_cloudwatch_log_group.this`                                     |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_internal_dns`           |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.0.0/24&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.1.0/24&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.2.0/24&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_endpoint.this`                                  |
|        | `module.vpn.aws_iam_saml_provider.client_vpn`                                  |
|        | `module.vpn.aws_iam_saml_provider.client_vpn_self_service`                     |
|        | `module.vpn.aws_security_group.this`                                           |
|        | `module.vpn.aws_security_group_rule.egress_all`                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.client_vpn will be created
  + resource "aws_acm_certificate" "client_vpn" {
      + arn                       = (known after apply)
      + certificate_body          = (sensitive value)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.vpn.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/client-vpn-endpoint/private-subnets"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_internal_dns will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_internal_dns" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Authorization for private-subnets to DNS"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.0.2/32"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.0.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.0.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.0.0/24"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.1.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.1.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.1.0/24"
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.2.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      + access_group_id        = (sensitive value)
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.2.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.2.0/24"
    }

  # module.vpn.aws_ec2_client_vpn_endpoint.this will be created
  + resource "aws_ec2_client_vpn_endpoint" "this" {
      + arn                    = (known after apply)
      + client_cidr_block      = "172.16.0.0/22"
      + description            = "private-subnets"
      + dns_name               = (known after apply)
      + dns_servers            = [
          + "10.0.0.2",
        ]
      + id                     = (known after apply)
      + security_group_ids     = (known after apply)
      + self_service_portal    = "enabled"
      + server_certificate_arn = (known after apply)
      + session_timeout_hours  = 8
      + split_tunnel           = true
      + tags                   = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + transport_protocol     = "udp"
      + vpc_id                 = "vpc-097508d1f5e243195"
      + vpn_port               = 443

      + authentication_options {
          + saml_provider_arn              = (known after apply)
          + self_service_saml_provider_arn = (known after apply)
          + type                           = "federated-authentication"
        }

      + client_login_banner_options {
          + banner_text = "This is a private network.  Only authorized users may connect and should take care not to cause service disruptions."
          + enabled     = true
        }

      + connection_log_options {
          + cloudwatch_log_group  = "/aws/client-vpn-endpoint/private-subnets"
          + cloudwatch_log_stream = (known after apply)
          + enabled               = true
        }
    }

  # module.vpn.aws_iam_saml_provider.client_vpn will be created
  + resource "aws_iam_saml_provider" "client_vpn" {
      + arn                    = (known after apply)
      + id                     = (known after apply)
      + name                   = "client-vpn"
      + saml_metadata_document = (sensitive value)
      + tags                   = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + valid_until            = (known after apply)
    }

  # module.vpn.aws_iam_saml_provider.client_vpn_self_service will be created
  + resource "aws_iam_saml_provider" "client_vpn_self_service" {
      + arn                    = (known after apply)
      + id                     = (known after apply)
      + name                   = "client-vpn-self-service"
      + saml_metadata_document = (sensitive value)
      + tags                   = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + valid_until            = (known after apply)
    }

  # module.vpn.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Egress All. Used to allow access to other security groups."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-vpn-endpoint-private-subnets"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

  # module.vpn.aws_security_group_rule.egress_all will be created
  + resource "aws_security_group_rule" "egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 51 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
